app/controllers/matches_controller.rb

INSERT INTO "matches" ("post_comment", "created_at", "updated_at", "user2_id", "user1_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_comment", "asdf"], ["created_at", "2019-09-21 00:34:19.096552"], ["updated_at", "2019-09-21 00:34:19.096552"], ["user2_id", 3], ["user1_id", 1]]
---
  def create
    @match = Match.new(match_params)

    if @match.save

UPDATE "matches" SET "post_comment" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["post_comment", "asdf"], ["updated_at", "2019-09-17 02:36:51.702052"], ["id", 1]]
---
  def update
    if @match.update(match_params)

DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 1]]
---
  def destroy
    @match.destroy