app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "image_link", "social_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save