app/models/user.rb

SELECT "matches".* FROM "matches" WHERE (user1_id = 1 OR user2_id = 1)
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def matches
    Match.where("user1_id = ? OR user2_id = ?", self.id, self.id)